Revit 2027 API
Application.NewProjectDocument Method
Overload List
Name | Description
NewProjectDocument(String) |  New project document
NewProjectDocument(UnitSystem) |  Creates a new project document with no template file specified.
Top
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace